Revit 2024 API
StructuralAsset.ConcreteShearStrengthReduction Property
 The shear strength reduction of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public double ConcreteShearStrengthReduction { get; set; }
Visual Basic
Public Property ConcreteShearStrengthReduction As Double
	Get
	Set
Visual C++
public:
property double ConcreteShearStrengthReduction {
	double get ();
	void set (double value);
}
Remarks
 Applies to concrete-based structural assets.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InapplicableDataException |  When setting this property: the material type must be concrete to set this property.
See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace